# Titanic - Machine Learning from Disaster
#### Start here! Predict survival on the Titanic and get familiar with ML basics

Link for Database + Instructions:
https://www.kaggle.com/c/titanic/data

# Sprint 1
Quer dizer que esta é minha primeira solução, a primeira solução é a mais simples e que tem menos profundidade na solução a ser criada. A cada novo sprint, mas profundidade nas análises, visualizações e conclusões serão empregadas, já que o propósito do sprint e saber aplicar diferentes níveis de estado de conhecimento em uma mesma solução.<br>
DATA: 13-04-2022

* Sem visualizações
* Sem Feature Engineering
* Com pouco aprimoramento em Missing Values
* Sem predição, Machine Learning

# Data Analysis Process

## 1) Entendendo a estrutura inicial do Dataset e criando questionamentos a serem analisados no passo 3

In [11]:
# importando bibliotecas
%matplotlib inline
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn; seaborn.set()

In [12]:
# importando Dataset
import os

pwd = os.getcwd()
data = pd.read_csv(f'{pwd}/data/train.csv', index_col='PassengerId')
data.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [13]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 891 entries, 1 to 891
Data columns (total 11 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Pclass    891 non-null    int64
 2   Name      891 non-null    object
 3   Sex       891 non-null    object
 4   Age       714 non-null    float64
 5   SibSp     891 non-null    int64
 6   Parch     891 non-null    int64
 7   Ticket    891 non-null    object
 8   Fare      891 non-null    float64
 9   Cabin     204 non-null    object
 10  Embarked  889 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 83.5+ KB

In [14]:
data.describe().round()

       Survived  Pclass    Age  SibSp  Parch   Fare
count     891.0   891.0  714.0  891.0  891.0  891.0
mean        0.0     2.0   30.0    1.0    0.0   32.0
std         0.0     1.0   15.0    1.0    1.0   50.0
min         0.0     1.0    0.0    0.0    0.0    0.0
25%         0.0     2.0   20.0    0.0    0.0    8.0
50%         0.0     3.0   28.0    0.0    0.0   14.0
75%         1.0     3.0   38.0    1.0    0.0   31.0
max         1.0     3.0   80.0    8.0    6.0  512.0

### 1.2) Questionamentos

1. Qual a porcentagem de mulheres que sobreviveram?
2. Qual a porcentagem de homens que sobreviveram?
3. Dentre os homens e mulheres que sobrevieram qual a porcentagem de representatividade do dataset para cada classe(pclass) distinta?
4. Relação entre idade e chances de ter sobrevivido
5. Das pessoas que não sobreviveram, qual a média de parentes dentro do navio?
6. Das pessoas que sobreviveram, qual a média de parentes dentro do navio?
7. Existe relação entre a cabine do passageiro (local do barco onde ele estava situado (lado esquerdo, centro, direito)) e sua probabilidade de ter sobrevivido?
8. De qual porto que embarcaram mais pessoas que não sobreviveram?
9. O que aconteceu com os 10% de pessoas que pagaram as maiores quantias(fare) pelos tickets?
10. De qual pclass uma pessoa tinha mais chances de ter sobrevivido?

## 2) Data Cleaning (Wranggling)

#### \# Substituindo tipos de dados de colunas por tipos mais eficientes

In [15]:
initial_mu = data.memory_usage().sum()
print(f'{initial_mu:,} bytes')

85,536 bytes

In [16]:
data.dtypes

Survived      int64
Pclass        int64
Name         object
Sex          object
Age         float64
SibSp         int64
Parch         int64
Ticket       object
Fare        float64
Cabin        object
Embarked     object
dtype: object

In [17]:
data[['Survived', 'Pclass', 'SibSp', 'Parch']] = data[['Survived', 'Pclass', 'SibSp', 'Parch']].astype('int16')
data[['Age', 'Fare']] = data[['Age', 'Fare']].astype('float32')
data.dtypes

Survived      int16
Pclass        int16
Name         object
Sex          object
Age         float32
SibSp         int16
Parch         int16
Ticket       object
Fare        float32
Cabin        object
Embarked     object
dtype: object

In [18]:
final_mu = data.memory_usage().sum()
print(f'{final_mu:,} bytes')

57,024 bytes

In [19]:
print(f'The size in memory of the dataset reduced {100-((final_mu*100)/initial_mu):,.2f}%. From {initial_mu:,} bytes to {final_mu:,} bytes.')

The size in memory of the dataset reduced 33.33%. From 85,536 bytes to 57,024 bytes.

#### \# Tratando dados nulos

In [20]:
data.isnull().sum()

Survived      0
Pclass        0
Name          0
Sex           0
Age         177
SibSp         0
Parch         0
Ticket        0
Fare          0
Cabin       687
Embarked      2
dtype: int64

In [21]:
data['Cabin'].fillna('W.O', inplace=True)
data.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.250000,W.O,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.283302,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.925000,W.O,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.099998,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.050000,W.O,S

In [22]:
df = data.dropna()
df.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.250000,W.O,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.283302,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.925000,W.O,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.099998,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.050000,W.O,S

In [23]:
df.shape

(712, 11)

#### \# Tratando Outliers

In [24]:
df.describe().round()

       Survived  Pclass    Age  SibSp  Parch   Fare
count     712.0   712.0  712.0  712.0  712.0  712.0
mean        0.0     2.0   30.0    1.0    0.0   35.0
std         0.0     1.0   14.0    1.0    1.0   53.0
min         0.0     1.0    0.0    0.0    0.0    0.0
25%         0.0     1.0   20.0    0.0    0.0    8.0
50%         0.0     2.0   28.0    0.0    0.0   16.0
75%         1.0     3.0   38.0    1.0    1.0   33.0
max         1.0     3.0   80.0    5.0    6.0  512.0

In [25]:
df.sort_values('Fare', ascending=False).head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
680,1,1,"Cardeza, Mr. Thomas Drake Martinez",male,36.0,0,1,PC 17755,512.329224,B51 B53 B55,C
259,1,1,"Ward, Miss. Anna",female,35.0,0,0,PC 17755,512.329224,W.O,C
738,1,1,"Lesurer, Mr. Gustave J",male,35.0,0,0,PC 17755,512.329224,B101,C
439,0,1,"Fortune, Mr. Mark",male,64.0,1,4,19950,263.000000,C23 C25 C27,S
342,1,1,"Fortune, Miss. Alice Elizabeth",female,24.0,3,2,19950,263.000000,C23 C25 C27,S

## 3) Exploratory Data Analysis

In [26]:
# 0. Porcentagem de pessoas que sobreviveramXnão-sobreviveram
tot_geral_sobreviveu = df.loc[df['Survived'] == 1].shape[0]
tot_geral_nao_sobreviveu = df.loc[df['Survived'] == 0].shape[0]

print(f'Total de pessoas que sobreviveram: {tot_geral_sobreviveu} | {tot_geral_sobreviveu/(tot_geral_sobreviveu+tot_geral_nao_sobreviveu)*100:.2f}%')
print(f'Total de pessoas que NÃO sobreviveram: {tot_geral_nao_sobreviveu} | {tot_geral_nao_sobreviveu/(tot_geral_sobreviveu+tot_geral_nao_sobreviveu)*100:.2f}%')

Total de pessoas que sobreviveram: 288 | 40.45%
Total de pessoas que NÃO sobreviveram: 424 | 59.55%

In [27]:
# 1. Qual a porcentagem de mulheres que sobreviveram?
tot_female = df[df['Sex'] == 'female'].shape[0]
tot_sobreviveu = df.loc[(df['Sex'] == 'female') & (df['Survived'] == 1)].shape[0]
porc_mul = (tot_sobreviveu/tot_female)*100
print(f'Apenas {porc_mul:.2f}% das mulheres sobreviveram.')

Apenas 75.29% das mulheres sobreviveram.

In [28]:
# 2. Qual a porcentagem de homens que sobreviveram?
tot_male = df[df['Sex'] == 'male'].shape[0]
tot_sobreviveu_male = df.loc[(df['Sex'] == 'male') & (df['Survived'] == 1)].shape[0]
porc_hom = (tot_sobreviveu_male/tot_male)*100
print(f'Apenas {porc_hom:.2f}% dos homens sobreviveram.')

Apenas 20.53% dos homens sobreviveram.

In [29]:
# 3. Dentre as pessoas que sobrevieram qual a porcentagem de representatividade do dataset para cada classe(pclass) distinta?
tot_1class = df[(df['Pclass'] == 1) & (df['Survived'] == 1)].shape[0]
tot_2class = df[(df['Pclass'] == 2) & (df['Survived'] == 1)].shape[0]
tot_3class = df[(df['Pclass'] == 3) & (df['Survived'] == 1)].shape[0]
tot_pessoas = df[df['Survived'] == 1].shape[0]

print(f'Das pessoas que sobreviveram, {(tot_1class/tot_pessoas)*100:.2f}% eram da 1° Classe.')
print(f'Das pessoas que sobreviveram, {(tot_2class/tot_pessoas)*100:.2f}% eram da 2° Classe.')
print(f'Das pessoas que sobreviveram, {(tot_3class/tot_pessoas)*100:.2f}% eram da 3° Classe.')

Das pessoas que sobreviveram, 41.67% eram da 1° Classe.
Das pessoas que sobreviveram, 28.82% eram da 2° Classe.
Das pessoas que sobreviveram, 29.51% eram da 3° Classe.

In [30]:
# 4. Relação entre idade e chances de ter sobrevivido
age_in_general = df['Age'].value_counts()
age_in_general
age_survivalness = df.loc[df['Survived'] == 1, ['Survived', 'Age']].groupby('Age').count()
age_survivalness["prob"] = (age_survivalness['Survived']/age_in_general).round(4)*100
age_survivalness.head(10)

      Survived    prob
Age
0.42         1  100.00
0.67         1  100.00
0.75         2  100.00
0.83         2  100.00
0.92         1  100.00
1.00         5   71.43
2.00         3   30.00
3.00         5   83.33
4.00         7   70.00
5.00         4  100.00

In [31]:
age_survivalness.tail(10)

      Survived    prob
Age
52.0         3   50.00
53.0         1  100.00
54.0         3   37.50
55.0         1   50.00
56.0         2   50.00
58.0         3   60.00
60.0         2   50.00
62.0         1   33.33
63.0         2  100.00
80.0         1  100.00

In [32]:
# 5. Das pessoas que não sobreviveram, qual a média de parentes dentro do navio?
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 712 entries, 1 to 891
Data columns (total 11 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  712 non-null    int16
 1   Pclass    712 non-null    int16
 2   Name      712 non-null    object
 3   Sex       712 non-null    object
 4   Age       712 non-null    float32
 5   SibSp     712 non-null    int16
 6   Parch     712 non-null    int16
 7   Ticket    712 non-null    object
 8   Fare      712 non-null    float32
 9   Cabin     712 non-null    object
 10  Embarked  712 non-null    object
dtypes: float32(2), int16(4), object(5)
memory usage: 44.5+ KB

In [33]:
tot_relateds = 0
arr_not_survided = df.loc[df['Survived'] == 0]
tot_relateds += arr_not_survided['SibSp'].shape[0] + arr_not_survided['Parch'].shape[0]
print(f'Das pessoas que não sobreviveram, a média de parentes dentro do navio era de {tot_relateds/arr_not_survided.shape[0]} parentes/pessoa.')

Das pessoas que não sobreviveram, a média de parentes dentro do navio era de 2.0 parentes/pessoa.

In [34]:
# 6. Das pessoas que sobreviveram, qual a média de parentes dentro do navio?
tot_relateds_sobreviveram = 0
arr_survided = df.loc[df['Survived'] == 1]
tot_relateds_sobreviveram += arr_survided['SibSp'].shape[0] + arr_survided['Parch'].shape[0]
print(f'Das pessoas que sobreviveram, a média de parentes dentro do navio era de {tot_relateds_sobreviveram/arr_survided.shape[0]} parentes/pessoa.')

Das pessoas que sobreviveram, a média de parentes dentro do navio era de 2.0 parentes/pessoa.

In [89]:
# 7. Existe relação entre a cabine do passageiro (local do barco onde ele estava situado (lado esquerdo, centro, direito)) e sua probabilidade de ter sobrevivido?
df['Cabin'].unique()

array(['W.O', 'C85', 'C123', 'E46', 'G6', 'C103', 'D56', 'A6',
       'C23 C25 C27', 'D33', 'B30', 'C83', 'F33', 'F G73', 'E31', 'A5',
       'D10 D12', 'D26', 'C110', 'B58 B60', 'E101', 'D47', 'B86', 'F2',
       'C2', 'B19', 'A7', 'C49', 'F4', 'B4', 'B80', 'A31', 'D36', 'D15',
       'C93', 'C78', 'D35', 'C87', 'B77', 'E67', 'B94', 'C125', 'C99',
       'C118', 'D7', 'B49', 'D', 'C22 C26', 'C65', 'E36', 'C54',
       'B57 B59 B63 B66', 'C7', 'E34', 'C32', 'B18', 'C124', 'C91', 'E40',
       'T', 'E33', 'D37', 'B35', 'E50', 'C82', 'B96 B98', 'E10', 'C52',
       'E44', 'A34', 'C104', 'C111', 'C92', 'E38', 'E12', 'E63', 'B37',
       'C30', 'D20', 'B79', 'E25', 'D46', 'B73', 'B38', 'B39', 'B22',
       'C86', 'C70', 'A16', 'C101', 'C68', 'A10', 'E68', 'B41', 'A20',
       'D19', 'D50', 'D9', 'A23', 'B50', 'A26', 'D48', 'E58', 'B71',
       'B51 B53 B55', 'D49', 'B5', 'B20', 'F G63', 'C62 C64', 'E24',
       'C90', 'C126', 'C45', 'E8', 'B101', 'C46', 'D30', 'E121', 'D11',
       'E77', 'B3', 'D6', 'B82 B84', 'D17', 'A36', 'B69', 'E49', 'D28',
       'E17', 'A24', 'C50', 'B42', 'C148'], dtype=object)

In [104]:
tot_com_cabin = df[df['Cabin'] != 'W.O'].shape[0]
print(f"Apenas {tot_com_cabin} pessoas tinham cabines registradas das pessoas no navio.")
print(f"Dessas {tot_com_cabin} pessoas, {df[(df['Cabin'] != 'W.O') & (df['Survived'] == 0)].shape[0]} não sobreviveram.")
print(f"Das {df[df['Cabin'] == 'W.O'].shape[0]} pessoas sem cabines registradas no navio, {df[(df['Cabin'] == 'W.O') & (df['Survived'] == 0)].shape[0]} não sobreviveram.")

Apenas 183 pessoas tinham cabines registradas das pessoas no navio.
Dessas 183 pessoas, 60 não sobreviveram.
Das 529 pessoas sem cabines registradas no navio, 364 não sobreviveram.

In [43]:
# 8. De qual porto que embarcaram mais pessoas que não sobreviveram?
port_survivalness = df.loc[df['Survived'] == 0, ['Survived', 'Embarked']].groupby( 'Embarked' ).count()

In [56]:
print(f'O porto do qual sairam mais pessoas que não sobreviveram foi o porto \'S\' com {port_survivalness.loc["S", "Survived"]} pessoas')

O porto do qual sairam mais pessoas que não sobreviveram foi o porto 'S' com 353 pessoas

In [81]:
# 9. O que aconteceu com os 10% de pessoas que pagaram as maiores quantias(fare) pelos tickets?
fare_10 = df.sort_values('Fare', ascending=True).iloc[-int(df.shape[0]*0.1):]

In [82]:
fare_10.describe().round()

       Survived  Pclass   Age  SibSp  Parch   Fare
count      71.0    71.0  71.0   71.0   71.0   71.0
mean        1.0     1.0  33.0    1.0    1.0  156.0
std         0.0     0.0  14.0    1.0    1.0   95.0
min         0.0     1.0   1.0    0.0    0.0   79.0
25%         1.0     1.0  22.0    0.0    0.0   90.0
50%         1.0     1.0  35.0    1.0    0.0  120.0
75%         1.0     1.0  42.0    1.0    2.0  188.0
max         1.0     1.0  64.0    3.0    4.0  512.0

In [86]:
porc_10_nao_surv = (fare_10[fare_10['Survived'] == 0].shape[0]/fare_10.shape[0])*100
porc_10_surv = (fare_10[fare_10['Survived'] == 1].shape[0]/fare_10.shape[0])*100

if porc_10_nao_surv > porc_10_surv:
    print(f'A maioria de {porc_10_nao_surv:.2f}% não sobreviveu infelizmente.')
else:
    print(f'A maioria de {porc_10_surv:.2f}%, felizmente, sobreviveu.')

A maioria de 76.06%, felizmente, sobreviveu.

In [57]:
# 10. De qual pclass uma pessoa tinha mais chances de ter sobrevivido?
df.loc[df['Survived'] == 1, ['Survived', 'Pclass']].groupby( 'Pclass' ).count()

        Survived
Pclass
1            120
2             83
3             85

In [58]:
print('A resposta é a 1° classe.')

A resposta é a 1° classe.